[
    {
        "headline": "Story rewards",
        "timestamp": 1678131599,
        "description": "A small update has been made to stories to make the rewards slightly more accurate; along with fixing a few bugs, you should now be able to get the usual story units from the campaign. As a result, they have been removed from the summoning pool."
    },
    {
        "headline": "Dragon updates",
        "timestamp": 1677018558,
        "description": "The server has been updated to support upgrading/unbinding dragons and the Dragon's Roost reliability system. Thanks to Nano#9384 for working on this!"
    },
    {
        "headline": "Quest drops improvement",
        "timestamp": 1676678446,
        "description": "Thanks to data sourced by the Dragalia Lost Wiki, each quest will now drop the correct set of items. This should help you gather materials for weapon upgrading. However, the quantities are still wrong (100 of everything) and they aren't assigned to enemies."
    },
    {
        "headline": "Weapon upgrading added",
        "timestamp": 1675896266,
        "description": "It is now possible to craft and upgrade weapons. This should be fully implemented, with materials being taken and passive abilities/weapon skills being levelled up appropriately. Please test this out and speak up if you notice any bugs!"
    },
    {
        "headline": "Weapon skins added",
        "timestamp": 1674868149,
        "description": "Support for weapon skins has been added via save import. Please check that you have all the ones you expect and that they work correctly within quests."
    },
    {
        "headline": "Halidom bonuses now accurate-ish",
        "timestamp": 1674854302,
        "description": "Element and weapon stat boosts should now be calculated from your Halidom buildings and unlocked weapon bonuses, rather than being set at 200%. However, encyclopedia bonuses will always be sent as the maximum until the encyclopedia is implemented."
    },
    {
        "headline": "Mana circles bug fixed",
        "timestamp": 1674589107,
        "description": "A nasty bug has been fixed with coability levels causing UI glitches/softlocks when unlocking mana nodes. If you were previously affected by this issue, please re-test and let us know if you encounter any further issues. Please note that unit stories cannot be unlocked at this time."
    },
    {
        "headline": "v1.1.0-alpha release",
        "timestamp": 1672957090,
        "description": "This version encapsulates the BaaS upgrades and various miscellaneous fixes since v1.0.0-alpha."
    },
    {
        "headline": "Savefile imports",
        "timestamp": 1672674212,
        "description": "The necessary work to pull savefiles from the BaaS login system has been completed. You can now import a savefile without needing to ask the server owner. See the \"Importing a save\" section below for more details."
    },
    {
        "headline": "New login server",
        "timestamp": 1672555688,
        "description": "Courtesy of LukeFZ#4035, the server now calls into an external login service which means account linking is now possible! It will also be possible soon to import a save via this service without having to direct message anyone."
    },
    {
        "headline": "v1.0.0-alpha release",
        "timestamp": 1671485237,
        "description": "This is the first public release of the server. Welcome everyone!"
    }
]
